zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2662/startup_MIMXRT2662.c
//*****************************************************************************
// MIMXRT2662_cm85 startup code
//
// Version : 180826
//*****************************************************************************
//
// Copyright 2016-2026 NXP
//
// SPDX-License-Identifier: BSD-3-Clause
//*****************************************************************************

#include <stdint.h>

#if defined(__cplusplus)
extern "C" {
#endif

//*****************************************************************************
// Section 1: Toolchain specific
//*****************************************************************************

#if defined(__ICCARM__)
//==============================================================================
// IAR
//==============================================================================

// Mark vector table as not init-needed; the exclusion propagates to all
// VT-reachable IRQ handlers, the functions they call, and the files
// containing them.
extern void (*const __iar_init$$done[])(void) __attribute__((alias("__vector_table")));

extern void __iar_program_start(void);

#define WEAK_AV                 __attribute__((weak))

#define STARTUP_PRAGMA_PUSH
#define STARTUP_PRAGMA_POP

#define STARTUP_RESET_ATTR      __stackless
#define STARTUP_RESET_C_ATTR    __root

#define STARTUP_VT_SECTION      __attribute__((used, section(".intvec")))
#define STARTUP_VT_SYMBOL       __vector_table

#pragma segment = "CSTACK"
#define _vStackTop              __section_end("CSTACK")
#define _vStackBase             __section_begin("CSTACK")

#define STARTUP_RUNTIME_PROLOG()
#define STARTUP_RUNTIME_ENTER()    do { \
    __asm volatile("cpsie i"); \
    __iar_program_start(); \
} while (0)


#elif defined(__ARMCC_VERSION)
//==============================================================================
// MDK
//==============================================================================

extern uint32_t Image$$ARM_LIB_STACK$$ZI$$Base[];
extern uint32_t Image$$ARM_LIB_STACK$$ZI$$Limit[];

extern void __main(void);

#define WEAK_AV                 __attribute__((weak))

#define STARTUP_PRAGMA_PUSH
#define STARTUP_PRAGMA_POP

#define STARTUP_RESET_ATTR      __attribute__((used, section("InRoot$$Sections"))) \
                                __attribute__((naked))
#define STARTUP_RESET_C_ATTR    __attribute__((used, section("InRoot$$Sections"), noinline))

#define STARTUP_VT_SECTION      __attribute__((used, section(".isr_vector")))
#define STARTUP_VT_SYMBOL       __Vectors

#define _vStackTop              Image$$ARM_LIB_STACK$$ZI$$Limit
#define _vStackBase             Image$$ARM_LIB_STACK$$ZI$$Base

#define STARTUP_RUNTIME_PROLOG()
#define STARTUP_RUNTIME_ENTER()    do { \
    __asm volatile("cpsie i"); \
    __main(); \
} while (0)


#elif defined(__GNUC__)
//==============================================================================
// ARMGCC
//==============================================================================

extern uint32_t __StackTop[];
extern uint32_t __StackLimit[];

/* Sections that need Flash-LMA -> RAM-VMA copy. Target-specific pairs
 * (TEXT / QACODE / QADATA) resolve to 0 via linker PROVIDE fallback when
 * absent, so their loops are no-ops without a build-time macro. */
extern uint32_t __DATA_ROM[];
extern uint32_t __data_start__[];
extern uint32_t __data_end__[];

extern uint32_t __CACHELINE_ROM[];
extern uint32_t __cacheline_data_start__[];
extern uint32_t __cacheline_data_end__[];

extern uint32_t __NDATA_ROM[];
extern uint32_t __noncache_data_start__[];
extern uint32_t __noncache_data_end__[];

extern uint32_t __APP_QACODE_ROM[];
extern uint32_t __app_qacode_start__[];
extern uint32_t __app_qacode_end__[];

extern uint32_t __TEXT_ROM[];
extern uint32_t __text_start__[];
extern uint32_t __text_end__[];

extern uint32_t __QACODE_ROM[];
extern uint32_t __qacode_start__[];
extern uint32_t __qacode_end__[];

extern uint32_t __QADATA_ROM[];
extern uint32_t __qadata_start__[];
extern uint32_t __qadata_end__[];

extern uint32_t __DATAEXT_ROM[];
extern uint32_t __dataext_data_start__[];
extern uint32_t __dataext_data_end__[];

/* Zero-init (BSS-like) sections */
extern uint32_t __bss_start__[];
extern uint32_t __bss_end__[];
extern uint32_t __cacheline_bss_start__[];
extern uint32_t __cacheline_bss_end__[];
extern uint32_t __noncache_bss_start__[];
extern uint32_t __noncache_bss_end__[];
extern uint32_t __dataext_bss_start__[];
extern uint32_t __dataext_bss_end__[];

extern void _start(void);

/* This routine performs the scatter-copy, so it MUST live in Flash pre-scatter.
 * Without .text.startup, -ffunction-sections would put it in .text (VMA=RAM for
 * ram/psram/psram_txt targets), and Reset_Handler_C would branch to unloaded
 * RAM and HardFault. */
__attribute__((used, noinline, section(".text.startup")))
static void toolchain_manual_init(void)
{
    uint32_t *src, *dst;

    src = __DATA_ROM;        dst = __data_start__;
    while (dst < __data_end__)           *dst++ = *src++;

    src = __CACHELINE_ROM;   dst = __cacheline_data_start__;
    while (dst < __cacheline_data_end__) *dst++ = *src++;

    src = __NDATA_ROM;       dst = __noncache_data_start__;
    while (dst < __noncache_data_end__)  *dst++ = *src++;

    src = __APP_QACODE_ROM;  dst = __app_qacode_start__;
    while (dst < __app_qacode_end__)     *dst++ = *src++;

    src = __TEXT_ROM;        dst = __text_start__;
    while (dst < __text_end__)           *dst++ = *src++;

    src = __QACODE_ROM;      dst = __qacode_start__;
    while (dst < __qacode_end__)         *dst++ = *src++;

    src = __QADATA_ROM;      dst = __qadata_start__;
    while (dst < __qadata_end__)         *dst++ = *src++;

    src = __DATAEXT_ROM;     dst = __dataext_data_start__;
    while (dst < __dataext_data_end__)   *dst++ = *src++;

    dst = __bss_start__;
    while (dst < __bss_end__)            *dst++ = 0U;

    dst = __cacheline_bss_start__;
    while (dst < __cacheline_bss_end__)  *dst++ = 0U;

    dst = __noncache_bss_start__;
    while (dst < __noncache_bss_end__)   *dst++ = 0U;

