zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2662/startup_MIMXRT2662.c
//*****************************************************************************
// Section 5: IRQ function implementations
//*****************************************************************************
void CMPT_CM85_CTI_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved17_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved18_DriverIRQHandler(void) ALIAS(DefaultISR);
void CMPT_CM85_ECC_ERROR_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved20_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved21_DriverIRQHandler(void) ALIAS(DefaultISR);
void CMPT_CM85_MCM_DriverIRQHandler(void) ALIAS(DefaultISR);
void CMPT_TRDC_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved24_DriverIRQHandler(void) ALIAS(DefaultISR);
void CMPT_SRAMCTL_0_DriverIRQHandler(void) ALIAS(DefaultISR);
void CMPT_SRAMCTL_1_DriverIRQHandler(void) ALIAS(DefaultISR);
void CMPT_SRAMCTL_2_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved28_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved29_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved30_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved31_DriverIRQHandler(void) ALIAS(DefaultISR);
void CMPT_FREQME_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved33_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved34_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved35_DriverIRQHandler(void) ALIAS(DefaultISR);
void CMPT_LLC_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved37_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved38_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved39_DriverIRQHandler(void) ALIAS(DefaultISR);
void CMPT_DAP_DriverIRQHandler(void) ALIAS(DefaultISR);
void MAIN_TRDC_DriverIRQHandler(void) ALIAS(DefaultISR);
void MAIN_AHB2AXI_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved43_DriverIRQHandler(void) ALIAS(DefaultISR);
void MAIN_MMU_DriverIRQHandler(void) ALIAS(DefaultISR);
void EDMA_DriverIRQHandler(uint32_t instance, uint32_t channel) ALIAS(DefaultISR2);
void MAIN_FREQME_DriverIRQHandler(void) ALIAS(DefaultISR);
void STM_DriverIRQHandler(uint32_t instance) ALIAS(DefaultISR1);
void Reserved95_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved96_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved97_DriverIRQHandler(void) ALIAS(DefaultISR);
void XSPI_DriverIRQHandler(uint32_t instance) ALIAS(DefaultISR1);
void Reserved100_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved101_DriverIRQHandler(void) ALIAS(DefaultISR);
void SYSCON_CGU_INT0_DriverIRQHandler(void) ALIAS(DefaultISR);
void SYSCON_CGU_INT1_DriverIRQHandler(void) ALIAS(DefaultISR);
void SYSCON_CGU_INT2_DriverIRQHandler(void) ALIAS(DefaultISR);
void MAIN_CSSI_DriverIRQHandler(void) ALIAS(DefaultISR);
void MAIN_CSSI_SENTMU0A_DriverIRQHandler(void) ALIAS(DefaultISR);
void MAIN_CSSI_SENTMU1A_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved108_DriverIRQHandler(void) ALIAS(DefaultISR);
void SYSCON_PMU_INT0_DriverIRQHandler(void) ALIAS(DefaultISR);
void SYSCON_PMU_INT1_DriverIRQHandler(void) ALIAS(DefaultISR);
void SYSCON_RESETCON_DriverIRQHandler(void) ALIAS(DefaultISR);
void SYSCON_FREQME_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved113_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved114_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved115_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_XBAR0_CH0_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_XBAR0_CH1_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_XBAR0_CH2_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_XBAR0_CH3_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_XBAR0_CH4_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_XBAR0_CH5_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_XBAR0_CH6_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_XBAR0_CH7_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved124_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved125_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved126_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved127_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_ADC0_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_ADC1_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_DAC_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_LPIT0_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_LPIT1_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_EFLEXPWM0_CH0_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_EFLEXPWM0_CH1_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_EFLEXPWM0_CH2_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_EFLEXPWM0_CH3_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_EFLEXPWM0_ERROR_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_EFLEXPWM1_CH0_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_EFLEXPWM1_CH1_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_EFLEXPWM1_CH2_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_EFLEXPWM1_CH3_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_EFLEXPWM1_ERROR_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_EFLEXPWM2_CH0_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_EFLEXPWM2_CH1_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_EFLEXPWM2_CH2_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_EFLEXPWM2_CH3_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_EFLEXPWM2_ERROR_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_EFLEXPWM3_CH0_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_EFLEXPWM3_CH1_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_EFLEXPWM3_CH2_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_EFLEXPWM3_CH3_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_EFLEXPWM3_ERROR_DriverIRQHandler(void) ALIAS(DefaultISR);
void TPM_DriverIRQHandler(uint32_t instance) ALIAS(DefaultISR1);
void Reserved157_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved158_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved159_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved160_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved161_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved162_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved163_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved164_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_QTMR0_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_QTMR1_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_QTMR2_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_QTMR3_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_EQDC0_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_EQDC1_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_EQDC2_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_EQDC3_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_SINC0_CH0_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_SINC0_CH1_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_SINC0_CH2_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_SINC0_CH3_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_SINC1_CH0_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_SINC1_CH1_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_SINC1_CH2_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_SINC1_CH3_DriverIRQHandler(void) ALIAS(DefaultISR);
void FLEXCAN_DriverIRQHandler(uint32_t instance) ALIAS(DefaultISR1);
void HSP_FLEXCAN0_ERROR_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_FLEXCAN1_ERROR_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_FLEXCAN2_ERROR_DriverIRQHandler(void) ALIAS(DefaultISR);
void FLEXIO_CommonDriverIRQHandler(uint32_t instance) ALIAS(DefaultISR1);
void I3C_DriverIRQHandler(uint32_t instance) ALIAS(DefaultISR1);
void LPI2C_DriverIRQHandler(uint32_t instance) ALIAS(DefaultISR1);
void Reserved193_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved194_DriverIRQHandler(void) ALIAS(DefaultISR);
void LPSPI_DriverIRQHandler(uint32_t instance) ALIAS(DefaultISR1);
void LPUART_DriverIRQHandler(uint32_t instance) ALIAS(DefaultISR1);
void HSP_GPIO0_CH0_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_GPIO0_CH1_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_GPIO1_CH0_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_GPIO1_CH1_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_GPIO2_CH0_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_GPIO2_CH1_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_GPIO3_CH0_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_GPIO3_CH1_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_GPIO4_CH0_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSP_GPIO4_CH1_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved216_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved217_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved218_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved219_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved220_DriverIRQHandler(void) ALIAS(DefaultISR);
void WAKE_TRDC_DriverIRQHandler(void) ALIAS(DefaultISR);
void WAKE_XBAR_CH0_DriverIRQHandler(void) ALIAS(DefaultISR);
void WAKE_XBAR_CH1_DriverIRQHandler(void) ALIAS(DefaultISR);
void WAKE_ACMP0_DriverIRQHandler(void) ALIAS(DefaultISR);
void WAKE_ACMP1_DriverIRQHandler(void) ALIAS(DefaultISR);
void WAKE_ACMP2_DriverIRQHandler(void) ALIAS(DefaultISR);
void WAKE_ACMP3_DriverIRQHandler(void) ALIAS(DefaultISR);
void WAKE_EWM_DriverIRQHandler(void) ALIAS(DefaultISR);
void WAKE_FREQME_DriverIRQHandler(void) ALIAS(DefaultISR);
void WAKE_LPTMR0_DriverIRQHandler(void) ALIAS(DefaultISR);
void WAKE_LPTMR1_DriverIRQHandler(void) ALIAS(DefaultISR);
void WAKE_SWT0_DriverIRQHandler(void) ALIAS(DefaultISR);
void WAKE_SWT1_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved246_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved247_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved248_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved249_DriverIRQHandler(void) ALIAS(DefaultISR);
void WAKE_GPIO_CH0_DriverIRQHandler(void) ALIAS(DefaultISR);
void WAKE_GPIO_CH1_DriverIRQHandler(void) ALIAS(DefaultISR);
void PDM_EventHandleIRQ(uint32_t instance) ALIAS(DefaultISR1);
void PDM_ErrorHandleIRQ(uint32_t instance) ALIAS(DefaultISR1);
void PDM_HwvadEventHandleIRQ(uint32_t instance) ALIAS(DefaultISR1);
void PDM_HwvadErrorHandleIRQ(uint32_t instance) ALIAS(DefaultISR1);
void Reserved262_DriverIRQHandler(void) ALIAS(DefaultISR);
void VBAT_BBSM_INT0_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved264_DriverIRQHandler(void) ALIAS(DefaultISR);
void VBAT_TDET_DriverIRQHandler(void) ALIAS(DefaultISR);
void VBAT_LPTMR_DriverIRQHandler(void) ALIAS(DefaultISR);
void VBAT_RTC_DriverIRQHandler(void) ALIAS(DefaultISR);
void VBAT_GPIO_CH0_DriverIRQHandler(void) ALIAS(DefaultISR);
void VBAT_GPIO_CH1_DriverIRQHandler(void) ALIAS(DefaultISR);
void VBAT_VBATCON_DriverIRQHandler(void) ALIAS(DefaultISR);
void AUDIO_TRDC_DriverIRQHandler(void) ALIAS(DefaultISR);
void SAI_DriverIRQHandler(uint32_t instance) ALIAS(DefaultISR1);
void Reserved275_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved276_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved277_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved280_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved281_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved282_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved283_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved284_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved285_DriverIRQHandler(void) ALIAS(DefaultISR);
void AUDIO_SPDIF_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved295_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved296_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved297_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved298_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved299_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved300_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved301_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved302_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved303_DriverIRQHandler(void) ALIAS(DefaultISR);
void ASRC_CommonDriverIRQHandler(uint32_t instance) ALIAS(DefaultISR1);
void AUDIO_FREQME_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved306_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved307_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved308_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved309_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved310_DriverIRQHandler(void) ALIAS(DefaultISR);
void COMM_TRDC_DriverIRQHandler(void) ALIAS(DefaultISR);
void COMM_ENET_QOS_DriverIRQHandler(void) ALIAS(DefaultISR);
void COMM_ENET_QOS_TX_DriverIRQHandler(void) ALIAS(DefaultISR);
void COMM_ENET_QOS_RX_DriverIRQHandler(void) ALIAS(DefaultISR);
void ENET_CommonFrame0DriverIRQHandler(uint32_t instance) ALIAS(DefaultISR1);
void ENET_Ptp1588DriverIRQHandler(uint32_t instance) ALIAS(DefaultISR1);
void FLEXSPI_SLV_CommonDriverIRQHandler(uint32_t instance) ALIAS(DefaultISR1);
void COMM_USB0_DriverIRQHandler(void) ALIAS(DefaultISR);
void COMM_USBPHY_DriverIRQHandler(void) ALIAS(DefaultISR);
void COMM_USB1_DriverIRQHandler(void) ALIAS(DefaultISR);
void USDHC_DriverIRQHandler(uint32_t instance) ALIAS(DefaultISR1);
void Reserved325_DriverIRQHandler(void) ALIAS(DefaultISR);
void COMM_TENBASET_PHY0_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved327_DriverIRQHandler(void) ALIAS(DefaultISR);
void COMM_TENBASET_PHY1_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved329_DriverIRQHandler(void) ALIAS(DefaultISR);
void COMM_FREQME_DriverIRQHandler(void) ALIAS(DefaultISR);
void MEDIA_TRDC_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved332_DriverIRQHandler(void) ALIAS(DefaultISR);
void MEDIA_DCIF_CH0_DriverIRQHandler(void) ALIAS(DefaultISR);
void MEDIA_DCIF_CH1_DriverIRQHandler(void) ALIAS(DefaultISR);
void MEDIA_DCIF_CH2_DriverIRQHandler(void) ALIAS(DefaultISR);
void MEDIA_DCIF_CH3_DriverIRQHandler(void) ALIAS(DefaultISR);
void MEDIA_DCIF_CH4_DriverIRQHandler(void) ALIAS(DefaultISR);
void MEDIA_DCIF_CH5_DriverIRQHandler(void) ALIAS(DefaultISR);
void MEDIA_DCIF_CH6_DriverIRQHandler(void) ALIAS(DefaultISR);
void MEDIA_DCIF_CH7_DriverIRQHandler(void) ALIAS(DefaultISR);
void MEDIA_DCIF_CH8_DriverIRQHandler(void) ALIAS(DefaultISR);
void CSI_CommonDriverIRQHandler(uint32_t instance) ALIAS(DefaultISR1);
void MEDIA_REFORMATTER_DriverIRQHandler(void) ALIAS(DefaultISR);
void MEDIA_ISI_DriverIRQHandler(void) ALIAS(DefaultISR);
void MEDIA_TINGPU_DriverIRQHandler(void) ALIAS(DefaultISR);
void MEDIA_JPEGDEC_DriverIRQHandler(void) ALIAS(DefaultISR);
void MEDIA_MIPI_CSI_DriverIRQHandler(void) ALIAS(DefaultISR);
void MIPI_DSI_CommonDriverIRQHandler(uint32_t instance) ALIAS(DefaultISR1);
void MEDIA_FREQME_DriverIRQHandler(void) ALIAS(DefaultISR);

//*****************************************************************************
// Processor ends up here if an unexpected interrupt occurs or a specific
// handler is not present in the application code.
//*****************************************************************************
WEAK_AV void DefaultISR(void)
{
    while (1)
    {
    }
}

WEAK_AV void DefaultISR2(uint32_t instance, uint32_t channel)
{
    while (1)
    {
    }
}

WEAK_AV void DefaultISR1(uint32_t instance)
{
    while (1)
    {
    }
}

WEAK_AV void NMI_Handler(void)
{
    while (1)
    {
    }
}

WEAK_AV void HardFault_Handler(void)
{
    while (1)
    {
    }
}

WEAK_AV void MemManage_Handler(void)
{
    while (1)
    {
    }
}

WEAK_AV void BusFault_Handler(void)
{
    while (1)
    {
    }
}

WEAK_AV void UsageFault_Handler(void)
{
    while (1)
    {
    }
}

WEAK_AV void SVC_Handler(void)
{
    while (1)
    {
    }
}

WEAK_AV void DebugMon_Handler(void)
{
    while (1)
    {
    }
}

WEAK_AV void PendSV_Handler(void)
{
    while (1)
    {
    }
}

WEAK_AV void SysTick_Handler(void)
{
    while (1)
    {
    }
}

