zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2662/startup_MIMXRT2662.c
WEAK void CMPT_CM85_CTI_IRQHandler(void)
{
    CMPT_CM85_CTI_DriverIRQHandler();
}

WEAK void Reserved17_IRQHandler(void)
{
    Reserved17_DriverIRQHandler();
}

WEAK void Reserved18_IRQHandler(void)
{
    Reserved18_DriverIRQHandler();
}

WEAK void CMPT_CM85_ECC_ERROR_IRQHandler(void)
{
    CMPT_CM85_ECC_ERROR_DriverIRQHandler();
}

WEAK void Reserved20_IRQHandler(void)
{
    Reserved20_DriverIRQHandler();
}

WEAK void Reserved21_IRQHandler(void)
{
    Reserved21_DriverIRQHandler();
}

WEAK void CMPT_CM85_MCM_IRQHandler(void)
{
    CMPT_CM85_MCM_DriverIRQHandler();
}

WEAK void CMPT_TRDC_IRQHandler(void)
{
    CMPT_TRDC_DriverIRQHandler();
}

WEAK void Reserved24_IRQHandler(void)
{
    Reserved24_DriverIRQHandler();
}

WEAK void CMPT_SRAMCTL_0_IRQHandler(void)
{
    CMPT_SRAMCTL_0_DriverIRQHandler();
}

WEAK void CMPT_SRAMCTL_1_IRQHandler(void)
{
    CMPT_SRAMCTL_1_DriverIRQHandler();
}

WEAK void CMPT_SRAMCTL_2_IRQHandler(void)
{
    CMPT_SRAMCTL_2_DriverIRQHandler();
}

WEAK void Reserved28_IRQHandler(void)
{
    Reserved28_DriverIRQHandler();
}

WEAK void Reserved29_IRQHandler(void)
{
    Reserved29_DriverIRQHandler();
}

WEAK void Reserved30_IRQHandler(void)
{
    Reserved30_DriverIRQHandler();
}

WEAK void Reserved31_IRQHandler(void)
{
    Reserved31_DriverIRQHandler();
}

WEAK void CMPT_FREQME_IRQHandler(void)
{
    CMPT_FREQME_DriverIRQHandler();
}

WEAK void Reserved33_IRQHandler(void)
{
    Reserved33_DriverIRQHandler();
}

WEAK void Reserved34_IRQHandler(void)
{
    Reserved34_DriverIRQHandler();
}

WEAK void Reserved35_IRQHandler(void)
{
    Reserved35_DriverIRQHandler();
}

WEAK void CMPT_LLC_IRQHandler(void)
{
    CMPT_LLC_DriverIRQHandler();
}

WEAK void Reserved37_IRQHandler(void)
{
    Reserved37_DriverIRQHandler();
}

WEAK void Reserved38_IRQHandler(void)
{
    Reserved38_DriverIRQHandler();
}

WEAK void Reserved39_IRQHandler(void)
{
    Reserved39_DriverIRQHandler();
}

WEAK void CMPT_DAP_IRQHandler(void)
{
    CMPT_DAP_DriverIRQHandler();
}

WEAK void MAIN_TRDC_IRQHandler(void)
{
    MAIN_TRDC_DriverIRQHandler();
}

WEAK void MAIN_AHB2AXI_IRQHandler(void)
{
    MAIN_AHB2AXI_DriverIRQHandler();
}

WEAK void Reserved43_IRQHandler(void)
{
    Reserved43_DriverIRQHandler();
}

WEAK void MAIN_MMU_IRQHandler(void)
{
    MAIN_MMU_DriverIRQHandler();
}

WEAK void MAIN_EDMA3_CH0_IRQHandler(void)
{
    EDMA_DriverIRQHandler(0U, 0U);
}

WEAK void MAIN_EDMA3_CH1_IRQHandler(void)
{
    EDMA_DriverIRQHandler(0U, 1U);
}

WEAK void MAIN_EDMA3_CH2_IRQHandler(void)
{
    EDMA_DriverIRQHandler(0U, 2U);
}

WEAK void MAIN_EDMA3_CH3_IRQHandler(void)
{
    EDMA_DriverIRQHandler(0U, 3U);
}

WEAK void MAIN_EDMA3_CH4_IRQHandler(void)
{
    EDMA_DriverIRQHandler(0U, 4U);
}

WEAK void MAIN_EDMA3_CH5_IRQHandler(void)
{
    EDMA_DriverIRQHandler(0U, 5U);
}

WEAK void MAIN_EDMA3_CH6_IRQHandler(void)
{
    EDMA_DriverIRQHandler(0U, 6U);
}

WEAK void MAIN_EDMA3_CH7_IRQHandler(void)
{
    EDMA_DriverIRQHandler(0U, 7U);
}

WEAK void MAIN_EDMA3_CH8_IRQHandler(void)
{
    EDMA_DriverIRQHandler(0U, 8U);
}

WEAK void MAIN_EDMA3_CH9_IRQHandler(void)
{
    EDMA_DriverIRQHandler(0U, 9U);
}

WEAK void MAIN_EDMA3_CH10_IRQHandler(void)
{
    EDMA_DriverIRQHandler(0U, 10U);
}

WEAK void MAIN_EDMA3_CH11_IRQHandler(void)
{
    EDMA_DriverIRQHandler(0U, 11U);
}

WEAK void MAIN_EDMA3_CH12_IRQHandler(void)
{
    EDMA_DriverIRQHandler(0U, 12U);
}

WEAK void MAIN_EDMA3_CH13_IRQHandler(void)
{
    EDMA_DriverIRQHandler(0U, 13U);
}

WEAK void MAIN_EDMA3_CH14_IRQHandler(void)
{
    EDMA_DriverIRQHandler(0U, 14U);
}

WEAK void MAIN_EDMA3_CH15_IRQHandler(void)
{
    EDMA_DriverIRQHandler(0U, 15U);
}

WEAK void MAIN_EDMA3_CH16_IRQHandler(void)
{
    EDMA_DriverIRQHandler(0U, 16U);
}

WEAK void MAIN_EDMA3_CH17_IRQHandler(void)
{
    EDMA_DriverIRQHandler(0U, 17U);
}

WEAK void MAIN_EDMA3_CH18_IRQHandler(void)
{
    EDMA_DriverIRQHandler(0U, 18U);
}

WEAK void MAIN_EDMA3_CH19_IRQHandler(void)
{
    EDMA_DriverIRQHandler(0U, 19U);
}

WEAK void MAIN_EDMA3_CH20_IRQHandler(void)
{
    EDMA_DriverIRQHandler(0U, 20U);
}

WEAK void MAIN_EDMA3_CH21_IRQHandler(void)
{
    EDMA_DriverIRQHandler(0U, 21U);
}

WEAK void MAIN_EDMA3_CH22_IRQHandler(void)
{
    EDMA_DriverIRQHandler(0U, 22U);
}

WEAK void MAIN_EDMA3_CH23_IRQHandler(void)
{
    EDMA_DriverIRQHandler(0U, 23U);
}

WEAK void MAIN_EDMA3_CH24_IRQHandler(void)
{
    EDMA_DriverIRQHandler(0U, 24U);
}

WEAK void MAIN_EDMA3_CH25_IRQHandler(void)
{
    EDMA_DriverIRQHandler(0U, 25U);
}

WEAK void MAIN_EDMA3_CH26_IRQHandler(void)
{
    EDMA_DriverIRQHandler(0U, 26U);
}

WEAK void MAIN_EDMA3_CH27_IRQHandler(void)
{
    EDMA_DriverIRQHandler(0U, 27U);
}

WEAK void MAIN_EDMA3_CH28_IRQHandler(void)
{
    EDMA_DriverIRQHandler(0U, 28U);
}

WEAK void MAIN_EDMA3_CH29_IRQHandler(void)
{
    EDMA_DriverIRQHandler(0U, 29U);
}

WEAK void MAIN_EDMA3_CH30_IRQHandler(void)
{
    EDMA_DriverIRQHandler(0U, 30U);
}

WEAK void MAIN_EDMA3_CH31_IRQHandler(void)
{
    EDMA_DriverIRQHandler(0U, 31U);
}

WEAK void MAIN_EDMA5_CH0_IRQHandler(void)
{
    EDMA_DriverIRQHandler(1U, 0U);
}

WEAK void MAIN_EDMA5_CH1_IRQHandler(void)
{
    EDMA_DriverIRQHandler(1U, 1U);
}

WEAK void MAIN_EDMA5_CH2_IRQHandler(void)
{
    EDMA_DriverIRQHandler(1U, 2U);
}

WEAK void MAIN_EDMA5_CH3_IRQHandler(void)
{
    EDMA_DriverIRQHandler(1U, 3U);
}

WEAK void MAIN_EDMA5_CH4_IRQHandler(void)
{
    EDMA_DriverIRQHandler(1U, 4U);
}

WEAK void MAIN_EDMA5_CH5_IRQHandler(void)
{
    EDMA_DriverIRQHandler(1U, 5U);
}

WEAK void MAIN_EDMA5_CH6_IRQHandler(void)
{
    EDMA_DriverIRQHandler(1U, 6U);
}

WEAK void MAIN_EDMA5_CH7_IRQHandler(void)
{
    EDMA_DriverIRQHandler(1U, 7U);
}

WEAK void MAIN_EDMA5_CH8_IRQHandler(void)
{
    EDMA_DriverIRQHandler(1U, 8U);
}

WEAK void MAIN_EDMA5_CH9_IRQHandler(void)
{
    EDMA_DriverIRQHandler(1U, 9U);
}

WEAK void MAIN_EDMA5_CH10_IRQHandler(void)
{
    EDMA_DriverIRQHandler(1U, 10U);
}

WEAK void MAIN_EDMA5_CH11_IRQHandler(void)
{
    EDMA_DriverIRQHandler(1U, 11U);
}

WEAK void MAIN_EDMA5_CH12_IRQHandler(void)
{
    EDMA_DriverIRQHandler(1U, 12U);
}

WEAK void MAIN_EDMA5_CH13_IRQHandler(void)
{
    EDMA_DriverIRQHandler(1U, 13U);
}

WEAK void MAIN_EDMA5_CH14_IRQHandler(void)
{
    EDMA_DriverIRQHandler(1U, 14U);
}

