zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2662/startup_MIMXRT2662.c
WEAK void COMM_ENET_RX_IRQHandler(void)
{
    ENET_CommonFrame0DriverIRQHandler(0U);
}

WEAK void COMM_ENET_OTHER_IRQHandler(void)
{
    ENET_CommonFrame0DriverIRQHandler(0U);
}

WEAK void COMM_ENET_1588_IRQHandler(void)
{
    ENET_Ptp1588DriverIRQHandler(0U);
}

WEAK void COMM_FLEXSPI_SLV_IRQHandler(void)
{
    FLEXSPI_SLV_CommonDriverIRQHandler(0U);
}

WEAK void COMM_USB0_IRQHandler(void)
{
    COMM_USB0_DriverIRQHandler();
}

WEAK void COMM_USBPHY_IRQHandler(void)
{
    COMM_USBPHY_DriverIRQHandler();
}

WEAK void COMM_USB1_IRQHandler(void)
{
    COMM_USB1_DriverIRQHandler();
}

WEAK void COMM_USDHC0_IRQHandler(void)
{
    USDHC_DriverIRQHandler(0U);
}

WEAK void COMM_USDHC1_IRQHandler(void)
{
    USDHC_DriverIRQHandler(1U);
}

WEAK void Reserved325_IRQHandler(void)
{
    Reserved325_DriverIRQHandler();
}

WEAK void COMM_TENBASET_PHY0_IRQHandler(void)
{
    COMM_TENBASET_PHY0_DriverIRQHandler();
}

WEAK void Reserved327_IRQHandler(void)
{
    Reserved327_DriverIRQHandler();
}

WEAK void COMM_TENBASET_PHY1_IRQHandler(void)
{
    COMM_TENBASET_PHY1_DriverIRQHandler();
}

WEAK void Reserved329_IRQHandler(void)
{
    Reserved329_DriverIRQHandler();
}

WEAK void COMM_FREQME_IRQHandler(void)
{
    COMM_FREQME_DriverIRQHandler();
}

WEAK void MEDIA_TRDC_IRQHandler(void)
{
    MEDIA_TRDC_DriverIRQHandler();
}

WEAK void Reserved332_IRQHandler(void)
{
    Reserved332_DriverIRQHandler();
}

WEAK void MEDIA_DCIF_CH0_IRQHandler(void)
{
    MEDIA_DCIF_CH0_DriverIRQHandler();
}

WEAK void MEDIA_DCIF_CH1_IRQHandler(void)
{
    MEDIA_DCIF_CH1_DriverIRQHandler();
}

WEAK void MEDIA_DCIF_CH2_IRQHandler(void)
{
    MEDIA_DCIF_CH2_DriverIRQHandler();
}

WEAK void MEDIA_DCIF_CH3_IRQHandler(void)
{
    MEDIA_DCIF_CH3_DriverIRQHandler();
}

WEAK void MEDIA_DCIF_CH4_IRQHandler(void)
{
    MEDIA_DCIF_CH4_DriverIRQHandler();
}

WEAK void MEDIA_DCIF_CH5_IRQHandler(void)
{
    MEDIA_DCIF_CH5_DriverIRQHandler();
}

WEAK void MEDIA_DCIF_CH6_IRQHandler(void)
{
    MEDIA_DCIF_CH6_DriverIRQHandler();
}

WEAK void MEDIA_DCIF_CH7_IRQHandler(void)
{
    MEDIA_DCIF_CH7_DriverIRQHandler();
}

WEAK void MEDIA_DCIF_CH8_IRQHandler(void)
{
    MEDIA_DCIF_CH8_DriverIRQHandler();
}

WEAK void MEDIA_CSI_IRQHandler(void)
{
    CSI_CommonDriverIRQHandler(0U);
}

WEAK void MEDIA_REFORMATTER_IRQHandler(void)
{
    MEDIA_REFORMATTER_DriverIRQHandler();
}

WEAK void MEDIA_ISI_IRQHandler(void)
{
    MEDIA_ISI_DriverIRQHandler();
}

WEAK void MEDIA_TINGPU_IRQHandler(void)
{
    MEDIA_TINGPU_DriverIRQHandler();
}

WEAK void MEDIA_JPEGDEC_IRQHandler(void)
{
    MEDIA_JPEGDEC_DriverIRQHandler();
}

WEAK void MEDIA_MIPI_CSI_IRQHandler(void)
{
    MEDIA_MIPI_CSI_DriverIRQHandler();
}

WEAK void MEDIA_MIPI_DSI_IRQHandler(void)
{
    MIPI_DSI_CommonDriverIRQHandler(0U);
}

WEAK void MEDIA_FREQME_IRQHandler(void)
{
    MEDIA_FREQME_DriverIRQHandler();
}

STARTUP_VT_SECTION
void (*const STARTUP_VT_SYMBOL[])(void) = {
    // Core Level - CM85
    (void (*)())((uint32_t)_vStackTop), // The initial stack pointer
    Reset_Handler,                      // The reset handler

    NMI_Handler,                        // NMI Handler
    HardFault_Handler,                  // Hard Fault Handler
    MemManage_Handler,                  // MPU Fault Handler
    BusFault_Handler,                   // Bus Fault Handler
    UsageFault_Handler,                 // Usage Fault Handler
    0,                                  // Reserved
    0,                                  // Reserved
    0,                                  // Reserved
    0,                                  // Reserved
    SVC_Handler,                        // SVCall Handler
    DebugMon_Handler,                   // Debug Monitor Handler
    0,                                  // Reserved
    PendSV_Handler,                     // PendSV Handler
    SysTick_Handler,                    // SysTick Handler

    // Chip Level - MIMXRT2662_cm85
    CMPT_CM85_CTI_IRQHandler,        // 16 : CM85: Cti Interrupt Request 0/Cti Interrupt Request 1
    Reserved17_IRQHandler,           // 17 : Reserved interrupt
    Reserved18_IRQHandler,           // 18 : Reserved interrupt
    CMPT_CM85_ECC_ERROR_IRQHandler,  // 19 : CM85: Single / Multi Bit Ecc Error From L1$ Or Tcm
    Reserved20_IRQHandler,           // 20 : Reserved interrupt
    Reserved21_IRQHandler,           // 21 : Reserved interrupt
    CMPT_CM85_MCM_IRQHandler,        // 22 : CMPT CM85 MCM: Interrupt request
    CMPT_TRDC_IRQHandler,            // 23 : CMPT TRDC: Interrupt request
    Reserved24_IRQHandler,           // 24 : Reserved interrupt
    CMPT_SRAMCTL_0_IRQHandler,       // 25 : CMPT SRAMCTL0: Interrupt request
    CMPT_SRAMCTL_1_IRQHandler,       // 26 : CMPT SRAMCTL1: Interrupt request
    CMPT_SRAMCTL_2_IRQHandler,       // 27 : CMPT SRAMCTL2: Interrupt request
    Reserved28_IRQHandler,           // 28 : Reserved interrupt
    Reserved29_IRQHandler,           // 29 : Reserved interrupt
    Reserved30_IRQHandler,           // 30 : Reserved interrupt
    Reserved31_IRQHandler,           // 31 : Reserved interrupt
    CMPT_FREQME_IRQHandler,          // 32 : CMPT FREQME: Interrupt request
    Reserved33_IRQHandler,           // 33 : Reserved interrupt
    Reserved34_IRQHandler,           // 34 : Reserved interrupt
    Reserved35_IRQHandler,           // 35 : Reserved interrupt
    CMPT_LLC_IRQHandler,             // 36 : CMPT LLC: Interrupt request
    Reserved37_IRQHandler,           // 37 : Reserved interrupt
    Reserved38_IRQHandler,           // 38 : Reserved interrupt
    Reserved39_IRQHandler,           // 39 : Reserved interrupt
    CMPT_DAP_IRQHandler,             // 40 : CMPT DAP: Interrupt request
    MAIN_TRDC_IRQHandler,            // 41 : MAIN TRDC: Interrupt request
    MAIN_AHB2AXI_IRQHandler,         // 42 : XHB500: Interrupt On Error Response for a Buffered Or Early Terminated Write
    Reserved43_IRQHandler,           // 43 : Reserved interrupt
    MAIN_MMU_IRQHandler,             // 44 : MMU: Interrupt request
    MAIN_EDMA3_CH0_IRQHandler,       // 45 : MAIN EDMA3: Channel 0 interrupt
    MAIN_EDMA3_CH1_IRQHandler,       // 46 : MAIN EDMA3: Channel 1 interrupt
    MAIN_EDMA3_CH2_IRQHandler,       // 47 : MAIN EDMA3: Channel 2 interrupt
    MAIN_EDMA3_CH3_IRQHandler,       // 48 : MAIN EDMA3: Channel 3 interrupt
    MAIN_EDMA3_CH4_IRQHandler,       // 49 : MAIN EDMA3: Channel 4 interrupt
    MAIN_EDMA3_CH5_IRQHandler,       // 50 : MAIN EDMA3: Channel 5 interrupt
    MAIN_EDMA3_CH6_IRQHandler,       // 51 : MAIN EDMA3: Channel 6 interrupt
    MAIN_EDMA3_CH7_IRQHandler,       // 52 : MAIN EDMA3: Channel 7 interrupt
    MAIN_EDMA3_CH8_IRQHandler,       // 53 : MAIN EDMA3: Channel 8 interrupt
    MAIN_EDMA3_CH9_IRQHandler,       // 54 : MAIN EDMA3: Channel 9 interrupt
    MAIN_EDMA3_CH10_IRQHandler,      // 55 : MAIN EDMA3: Channel 10 interrupt
    MAIN_EDMA3_CH11_IRQHandler,      // 56 : MAIN EDMA3: Channel 11 interrupt
    MAIN_EDMA3_CH12_IRQHandler,      // 57 : MAIN EDMA3: Channel 12 interrupt
    MAIN_EDMA3_CH13_IRQHandler,      // 58 : MAIN EDMA3: Channel 13 interrupt
    MAIN_EDMA3_CH14_IRQHandler,      // 59 : MAIN EDMA3: Channel 14 interrupt
    MAIN_EDMA3_CH15_IRQHandler,      // 60 : MAIN EDMA3: Channel 15 interrupt
    MAIN_EDMA3_CH16_IRQHandler,      // 61 : MAIN EDMA3: Channel 16 interrupt
    MAIN_EDMA3_CH17_IRQHandler,      // 62 : MAIN EDMA3: Channel 17 interrupt
    MAIN_EDMA3_CH18_IRQHandler,      // 63 : MAIN EDMA3: Channel 18 interrupt
    MAIN_EDMA3_CH19_IRQHandler,      // 64 : MAIN EDMA3: Channel 19 interrupt
    MAIN_EDMA3_CH20_IRQHandler,      // 65 : MAIN EDMA3: Channel 20 interrupt
    MAIN_EDMA3_CH21_IRQHandler,      // 66 : MAIN EDMA3: Channel 21 interrupt
    MAIN_EDMA3_CH22_IRQHandler,      // 67 : MAIN EDMA3: Channel 22 interrupt
    MAIN_EDMA3_CH23_IRQHandler,      // 68 : MAIN EDMA3: Channel 23 interrupt
    MAIN_EDMA3_CH24_IRQHandler,      // 69 : MAIN EDMA3: Channel 24 interrupt
    MAIN_EDMA3_CH25_IRQHandler,      // 70 : MAIN EDMA3: Channel 25 interrupt
    MAIN_EDMA3_CH26_IRQHandler,      // 71 : MAIN EDMA3: Channel 26 interrupt
    MAIN_EDMA3_CH27_IRQHandler,      // 72 : MAIN EDMA3: Channel 27 interrupt
    MAIN_EDMA3_CH28_IRQHandler,      // 73 : MAIN EDMA3: Channel 28 interrupt
    MAIN_EDMA3_CH29_IRQHandler,      // 74 : MAIN EDMA3: Channel 29 interrupt
    MAIN_EDMA3_CH30_IRQHandler,      // 75 : MAIN EDMA3: Channel 30 interrupt
    MAIN_EDMA3_CH31_IRQHandler,      // 76 : MAIN EDMA3: Channel 31 interrupt
    MAIN_EDMA5_CH0_IRQHandler,       // 77 : MAIN EDMA5: Channel 0 interrupt
    MAIN_EDMA5_CH1_IRQHandler,       // 78 : MAIN EDMA5: Channel 1 interrupt
    MAIN_EDMA5_CH2_IRQHandler,       // 79 : MAIN EDMA5: Channel 2 interrupt
    MAIN_EDMA5_CH3_IRQHandler,       // 80 : MAIN EDMA5: Channel 3 interrupt
    MAIN_EDMA5_CH4_IRQHandler,       // 81 : MAIN EDMA5: Channel 4 interrupt
    MAIN_EDMA5_CH5_IRQHandler,       // 82 : MAIN EDMA5: Channel 5 interrupt
    MAIN_EDMA5_CH6_IRQHandler,       // 83 : MAIN EDMA5: Channel 6 interrupt
    MAIN_EDMA5_CH7_IRQHandler,       // 84 : MAIN EDMA5: Channel 7 interrupt
    MAIN_EDMA5_CH8_IRQHandler,       // 85 : MAIN EDMA5: Channel 8 interrupt
    MAIN_EDMA5_CH9_IRQHandler,       // 86 : MAIN EDMA5: Channel 9 interrupt
    MAIN_EDMA5_CH10_IRQHandler,      // 87 : MAIN EDMA5: Channel 10 interrupt
    MAIN_EDMA5_CH11_IRQHandler,      // 88 : MAIN EDMA5: Channel 11 interrupt
    MAIN_EDMA5_CH12_IRQHandler,      // 89 : MAIN EDMA5: Channel 12 interrupt
    MAIN_EDMA5_CH13_IRQHandler,      // 90 : MAIN EDMA5: Channel 13 interrupt
    MAIN_EDMA5_CH14_IRQHandler,      // 91 : MAIN EDMA5: Channel 14 interrupt
    MAIN_EDMA5_CH15_IRQHandler,      // 92 : MAIN EDMA5: Channel 15 interrupt
    MAIN_FREQME_IRQHandler,          // 93 : MAIN FREQME: interrupt request
    HSP_STM_IRQHandler,              // 94 : HSP STM: Interrupt request
    Reserved95_IRQHandler,           // 95 : Reserved interrupt
    Reserved96_IRQHandler,           // 96 : Reserved interrupt
    Reserved97_IRQHandler,           // 97 : Reserved interrupt
    MAIN_XSPI0_IRQHandler,           // 98 : MAIN XSPI0: interrupt request
    MAIN_XSPI1_IRQHandler,           // 99 : MAIN XSPI1: interrupt request
    Reserved100_IRQHandler,          // 100: Reserved interrupt
    Reserved101_IRQHandler,          // 101: Reserved interrupt
    SYSCON_CGU_INT0_IRQHandler,      // 102: CGU: Vdda 0V8 Status Interrupt
    SYSCON_CGU_INT1_IRQHandler,      // 103: CGU: Audiopll Dnum Update Done Interrupt
    SYSCON_CGU_INT2_IRQHandler,      // 104: CGU: Videopll Dnum Update Done Interrupt
    MAIN_CSSI_IRQHandler,            // 105: CSSI:Status/Error Interrupt/Active Interrupt
    MAIN_CSSI_SENTMU0A_IRQHandler,   // 106: CSSI_MU: MU0A Ored Tx Interrupt To Mua
    MAIN_CSSI_SENTMU1A_IRQHandler,   // 107: CSSI_MU: Mu1A Ored Tx Interrupt To Mua
    Reserved108_IRQHandler,          // 108: Reserved interrupt
    SYSCON_PMU_INT0_IRQHandler,      // 109: PMU: Ored All Sensor And Monitor Interrupts
    SYSCON_PMU_INT1_IRQHandler,      // 110: PMU: Body Bias Interrupt
    SYSCON_RESETCON_IRQHandler,      // 111: SYSCON RESETCON: Interrupt request
    SYSCON_FREQME_IRQHandler,        // 112: SYSCON FREQME: Interrupt request
    Reserved113_IRQHandler,          // 113: Reserved interrupt
    Reserved114_IRQHandler,          // 114: Reserved interrupt
    Reserved115_IRQHandler,          // 115: Reserved interrupt
    HSP_XBAR0_CH0_IRQHandler,        // 116: HSP XBAR0 Channel 0 interrupt
    HSP_XBAR0_CH1_IRQHandler,        // 117: HSP XBAR0 Channel 1 interrupt
    HSP_XBAR0_CH2_IRQHandler,        // 118: HSP XBAR0 Channel 2 interrupt
    HSP_XBAR0_CH3_IRQHandler,        // 119: HSP XBAR0 Channel 3 interrupt
    HSP_XBAR0_CH4_IRQHandler,        // 120: HSP XBAR0 Channel 4 interrupt
    HSP_XBAR0_CH5_IRQHandler,        // 121: HSP XBAR0 Channel 5 interrupt
    HSP_XBAR0_CH6_IRQHandler,        // 122: HSP XBAR0 Channel 6 interrupt
    HSP_XBAR0_CH7_IRQHandler,        // 123: HSP XBAR0 Channel 7 interrupt
    Reserved124_IRQHandler,          // 124: Reserved interrupt
    Reserved125_IRQHandler,          // 125: Reserved interrupt
    Reserved126_IRQHandler,          // 126: Reserved interrupt
    Reserved127_IRQHandler,          // 127: Reserved interrupt
    HSP_ADC0_IRQHandler,             // 128: HSP ADC0 interrupt
    HSP_ADC1_IRQHandler,             // 129: HSP ADC1 interrupt
    HSP_DAC_IRQHandler,              // 130: HSP DAC interrupt
    HSP_LPIT0_IRQHandler,            // 131: HSP LPIT0 interrupt
    HSP_LPIT1_IRQHandler,            // 132: HSP LPIT1 interrupt
    HSP_EFLEXPWM0_CH0_IRQHandler,    // 133: HSP EFLEXPWM0 channel 0 interrupt
    HSP_EFLEXPWM0_CH1_IRQHandler,    // 134: HSP EFLEXPWM0 channel 1 interrupt
    HSP_EFLEXPWM0_CH2_IRQHandler,    // 135: HSP EFLEXPWM0 channel 2 interrupt
    HSP_EFLEXPWM0_CH3_IRQHandler,    // 136: HSP EFLEXPWM0 channel 3 interrupt
    HSP_EFLEXPWM0_ERROR_IRQHandler,  // 137: HSP EFLEXPWM0 fault interrupt
    HSP_EFLEXPWM1_CH0_IRQHandler,    // 138: HSP EFLEXPWM1 channel 0 interrupt
    HSP_EFLEXPWM1_CH1_IRQHandler,    // 139: HSP EFLEXPWM1 channel 1 interrupt
    HSP_EFLEXPWM1_CH2_IRQHandler,    // 140: HSP EFLEXPWM1 channel 2 interrupt
    HSP_EFLEXPWM1_CH3_IRQHandler,    // 141: HSP EFLEXPWM1 channel 3 interrupt
    HSP_EFLEXPWM1_ERROR_IRQHandler,  // 142: HSP EFLEXPWM1 fault interrupt
    HSP_EFLEXPWM2_CH0_IRQHandler,    // 143: HSP EFLEXPWM2 channel 0 interrupt
    HSP_EFLEXPWM2_CH1_IRQHandler,    // 144: HSP EFLEXPWM2 channel 1 interrupt
    HSP_EFLEXPWM2_CH2_IRQHandler,    // 145: HSP EFLEXPWM2 channel 2 interrupt
    HSP_EFLEXPWM2_CH3_IRQHandler,    // 146: HSP EFLEXPWM2 channel 3 interrupt
    HSP_EFLEXPWM2_ERROR_IRQHandler,  // 147: HSP EFLEXPWM2 fault interrupt
    HSP_EFLEXPWM3_CH0_IRQHandler,    // 148: HSP EFLEXPWM3 channel 0 interrupt
    HSP_EFLEXPWM3_CH1_IRQHandler,    // 149: HSP EFLEXPWM3 channel 1 interrupt
    HSP_EFLEXPWM3_CH2_IRQHandler,    // 150: HSP EFLEXPWM3 channel 2 interrupt
    HSP_EFLEXPWM3_CH3_IRQHandler,    // 151: HSP EFLEXPWM3 channel 3 interrupt
    HSP_EFLEXPWM3_ERROR_IRQHandler,  // 152: HSP EFLEXPWM3 fault interrupt
    HSP_QTPM0_IRQHandler,            // 153: HSP QUADTPM0 interrupt
    HSP_QTPM1_IRQHandler,            // 154: HSP QUADTPM1 interrupt
    HSP_QTPM2_IRQHandler,            // 155: HSP QUADTPM2 interrupt
    HSP_QTPM3_IRQHandler,            // 156: HSP QUADTPM3 interrupt
    Reserved157_IRQHandler,          // 157: Reserved interrupt
    Reserved158_IRQHandler,          // 158: Reserved interrupt
    Reserved159_IRQHandler,          // 159: Reserved interrupt
    Reserved160_IRQHandler,          // 160: Reserved interrupt
    Reserved161_IRQHandler,          // 161: Reserved interrupt
    Reserved162_IRQHandler,          // 162: Reserved interrupt
    Reserved163_IRQHandler,          // 163: Reserved interrupt
    Reserved164_IRQHandler,          // 164: Reserved interrupt
    HSP_QTMR0_IRQHandler,            // 165: HSP QUADTMR0 interrupt
    HSP_QTMR1_IRQHandler,            // 166: HSP QUADTMR1 interrupt
    HSP_QTMR2_IRQHandler,            // 167: HSP QUADTMR2 interrupt
    HSP_QTMR3_IRQHandler,            // 168: HSP QUADTMR3 interrupt
    HSP_EQDC0_IRQHandler,            // 169: HSP EQDC0 interrupt
    HSP_EQDC1_IRQHandler,            // 170: HSP EQDC1 interrupt
    HSP_EQDC2_IRQHandler,            // 171: HSP EQDC2 interrupt
    HSP_EQDC3_IRQHandler,            // 172: HSP EQDC3 interrupt
    HSP_SINC0_CH0_IRQHandler,        // 173: HSP SINC0 channel 0 interrupt
    HSP_SINC0_CH1_IRQHandler,        // 174: HSP SINC0 channel 1 interrupt
    HSP_SINC0_CH2_IRQHandler,        // 175: HSP SINC0 channel 2 interrupt
    HSP_SINC0_CH3_IRQHandler,        // 176: HSP SINC0 channel 3 interrupt
    HSP_SINC1_CH0_IRQHandler,        // 177: HSP SINC1 channel 0 interrupt
    HSP_SINC1_CH1_IRQHandler,        // 178: HSP SINC1 channel 1 interrupt
    HSP_SINC1_CH2_IRQHandler,        // 179: HSP SINC1 channel 2 interrupt
    HSP_SINC1_CH3_IRQHandler,        // 180: HSP SINC1 channel 3 interrupt
    HSP_FLEXCAN0_IRQHandler,         // 181: HSP FLEXCAN0 interrupt
    HSP_FLEXCAN0_ERROR_IRQHandler,   // 182: HSP FLEXCAN0 error interrupt
    HSP_FLEXCAN1_IRQHandler,         // 183: HSP FLEXCAN1 interrupt
    HSP_FLEXCAN1_ERROR_IRQHandler,   // 184: HSP FLEXCAN1 error interrupt
    HSP_FLEXCAN2_IRQHandler,         // 185: HSP FLEXCAN2 interrupt
    HSP_FLEXCAN2_ERROR_IRQHandler,   // 186: HSP FLEXCAN2 error interrupt
    HSP_FLEXIO0_IRQHandler,          // 187: HSP FLEXIO0 interrupt
    HSP_FLEXIO1_IRQHandler,          // 188: HSP FLEXIO1 interrupt
    HSP_FLEXIO2_IRQHandler,          // 189: HSP FLEXIO2 interrupt
    HSP_I3C_IRQHandler,              // 190: HSP I3C interrupt
    HSP_LPI2C0_IRQHandler,           // 191: HSP LPI2C0 interrupt
    HSP_LPI2C1_IRQHandler,           // 192: HSP LPI2C1 interrupt
    Reserved193_IRQHandler,          // 193: Reserved interrupt
    Reserved194_IRQHandler,          // 194: Reserved interrupt
    HSP_LPSPI0_IRQHandler,           // 195: HSP LPSPI0 interrupt
    HSP_LPSPI1_IRQHandler,           // 196: HSP LPSPI1 interrupt
    HSP_LPSPI2_IRQHandler,           // 197: HSP LPSPI2 interrupt
    HSP_LPSPI3_IRQHandler,           // 198: HSP LPSPI3 interrupt
    HSP_LPSPI4_IRQHandler,           // 199: HSP LPSPI4 interrupt
    HSP_LPUART0_IRQHandler,          // 200: HSP LPUART0 interrupt
    HSP_LPUART1_IRQHandler,          // 201: HSP LPUART1 interrupt
    HSP_LPUART2_IRQHandler,          // 202: HSP LPUART2 interrupt
    HSP_LPUART3_IRQHandler,          // 203: HSP LPUART3 interrupt
    HSP_LPUART4_IRQHandler,          // 204: HSP LPUART4 interrupt
    HSP_LPUART5_IRQHandler,          // 205: HSP LPUART5 interrupt
    HSP_GPIO0_CH0_IRQHandler,        // 206: HSP GPIO0 channel 0 interrupt
    HSP_GPIO0_CH1_IRQHandler,        // 207: HSP GPIO0 channel 1 interrupt
    HSP_GPIO1_CH0_IRQHandler,        // 208: HSP GPIO1 channel 0 interrupt
    HSP_GPIO1_CH1_IRQHandler,        // 209: HSP GPIO1 channel 1 interrupt
    HSP_GPIO2_CH0_IRQHandler,        // 210: HSP GPIO2 channel 0 interrupt
    HSP_GPIO2_CH1_IRQHandler,        // 211: HSP GPIO2 channel 1 interrupt
    HSP_GPIO3_CH0_IRQHandler,        // 212: HSP GPIO3 channel 0 interrupt
    HSP_GPIO3_CH1_IRQHandler,        // 213: HSP GPIO3 channel 1 interrupt
    HSP_GPIO4_CH0_IRQHandler,        // 214: HSP GPIO4 channel 0 interrupt
    HSP_GPIO4_CH1_IRQHandler,        // 215: HSP GPIO4 channel 1 interrupt
    Reserved216_IRQHandler,          // 216: Reserved interrupt
    Reserved217_IRQHandler,          // 217: Reserved interrupt
    Reserved218_IRQHandler,          // 218: Reserved interrupt
    Reserved219_IRQHandler,          // 219: Reserved interrupt
    Reserved220_IRQHandler,          // 220: Reserved interrupt
    WAKE_TRDC_IRQHandler,            // 221: WAKE TRDC interrupt
    WAKE_XBAR_CH0_IRQHandler,        // 222: WAKE XBAR channel 0 interrupt
    WAKE_XBAR_CH1_IRQHandler,        // 223: WAKE XBAR channel 1 interrupt
    WAKE_EDMA3_CH0_IRQHandler,       // 224: WAKE EDMA3: Channel 0 interrupt
    WAKE_EDMA3_CH1_IRQHandler,       // 225: WAKE EDMA3: Channel 1 interrupt
    WAKE_EDMA3_CH2_IRQHandler,       // 226: WAKE EDMA3: Channel 2 interrupt
    WAKE_EDMA3_CH3_IRQHandler,       // 227: WAKE EDMA3: Channel 3 interrupt
    WAKE_EDMA3_CH4_IRQHandler,       // 228: WAKE EDMA3: Channel 4 interrupt
    WAKE_EDMA3_CH5_IRQHandler,       // 229: WAKE EDMA3: Channel 5 interrupt
    WAKE_EDMA3_CH6_IRQHandler,       // 230: WAKE EDMA3: Channel 6 interrupt
    WAKE_EDMA3_CH7_IRQHandler,       // 231: WAKE EDMA3: Channel 7 interrupt
    WAKE_ACMP0_IRQHandler,           // 232: WAKE CMP0 interrupt
    WAKE_ACMP1_IRQHandler,           // 233: WAKE CMP1 interrupt
    WAKE_ACMP2_IRQHandler,           // 234: WAKE CMP2 interrupt
    WAKE_ACMP3_IRQHandler,           // 235: WAKE CMP3 interrupt
    WAKE_EWM_IRQHandler,             // 236: WAKE EWM interrupt
    WAKE_FREQME_IRQHandler,          // 237: WAKE FREQME interrupt
    WAKE_LPTMR0_IRQHandler,          // 238: WAKE LPTMR0 interrupt
    WAKE_LPTMR1_IRQHandler,          // 239: WAKE LPTMR1 interrupt
    WAKE_QTPM0_IRQHandler,           // 240: WAKE QTPM0 interrupt
    WAKE_QTPM1_IRQHandler,           // 241: WAKE QTPM1 interrupt
    WAKE_QTPM2_IRQHandler,           // 242: WAKE QTPM2 interrupt
    WAKE_QTPM3_IRQHandler,           // 243: WAKE QTPM3 interrupt
    WAKE_SWT0_IRQHandler,            // 244: WAKE SWT0 interrupt
    WAKE_SWT1_IRQHandler,            // 245: WAKE SWT1 interrupt
    Reserved246_IRQHandler,          // 246: Reserved interrupt
    Reserved247_IRQHandler,          // 247: Reserved interrupt
    Reserved248_IRQHandler,          // 248: Reserved interrupt
    Reserved249_IRQHandler,          // 249: Reserved interrupt
    WAKE_I3C_IRQHandler,             // 250: WAKE I3C interrupt
    WAKE_LPI2C0_IRQHandler,          // 251: WAKE LPI2C0 interrupt
    WAKE_LPI2C1_IRQHandler,          // 252: WAKE LPI2C1 interrupt
    WAKE_LPSPI_IRQHandler,           // 253: WAKE LPSPI interrupt
    WAKE_LPUART0_IRQHandler,         // 254: WAKE LPUART0 interrupt
    WAKE_LPUART1_IRQHandler,         // 255: WAKE LPUART1 interrupt
    WAKE_GPIO_CH0_IRQHandler,        // 256: WAKE GPIO channel 0 interrupt
    WAKE_GPIO_CH1_IRQHandler,        // 257: WAKE GPIO channel 1 interrupt
    WAKE_PDM_EVENT_IRQHandler,       // 258: WAKE MICIFL  Filter Results Available (Fifo) Interrupt/
    WAKE_PDM_ERROR_IRQHandler,       // 259: WAKE MICIFL Error interrupt
    WAKE_PDM_HWVAD_EVENT_IRQHandler, // 260: WAKE MICIFL Hwvad Activation interrupt
    WAKE_PDM_HWVAD_ERROR_IRQHandler, // 261: WAKE MICIFL Hwvad Exception Interrupt
    Reserved262_IRQHandler,          // 262: Reserved interrupt
    VBAT_BBSM_INT0_IRQHandler,       // 263: BBSM: Alarm interrupt0
    Reserved264_IRQHandler,          // 264: Reserved interrupt
    VBAT_TDET_IRQHandler,            // 265: VBAT TDET interrupt
    VBAT_LPTMR_IRQHandler,           // 266: VBAT LPTMR interrupt
    VBAT_RTC_IRQHandler,             // 267: VBAT RTC interrupt
    VBAT_GPIO_CH0_IRQHandler,        // 268: VBAT GPIO channel 0 interrupt
    VBAT_GPIO_CH1_IRQHandler,        // 269: VBAT GPIO channel 1 interrupt
    VBAT_VBATCON_IRQHandler,         // 270: vbatcon Interrupt Request
    AUDIO_TRDC_IRQHandler,           // 271: AUDIO TRDC interrupt
    AUDIO_SAI0_IRQHandler,           // 272: AUDIO SAI0 interrupt
    AUDIO_SAI1_IRQHandler,           // 273: AUDIO SAI1 interrupt
    AUDIO_SAI2_IRQHandler,           // 274: AUDIO SAI2 interrupt
    Reserved275_IRQHandler,          // 275: Reserved interrupt
    Reserved276_IRQHandler,          // 276: Reserved interrupt
    Reserved277_IRQHandler,          // 277: Reserved interrupt
    AUDIO_PDM_EVENT_IRQHandler,      // 278: AUDIO MICDIL Filter Results Available (Fifo) Interrupt
    AUDIO_PDM_ERROR_IRQHandler,      // 279: AUDIO MICDIL Error interrupt
    Reserved280_IRQHandler,          // 280: Reserved interrupt
    Reserved281_IRQHandler,          // 281: Reserved interrupt
    Reserved282_IRQHandler,          // 282: Reserved interrupt
    Reserved283_IRQHandler,          // 283: Reserved interrupt
    Reserved284_IRQHandler,          // 284: Reserved interrupt
    Reserved285_IRQHandler,          // 285: Reserved interrupt
    AUDIO_SPDIF_IRQHandler,          // 286: AUDIO SPDIF interrupt
    AUDIO_EDMA3_CH0_IRQHandler,      // 287: AUDIO EDMA3: Channel 0 interrupt
    AUDIO_EDMA3_CH1_IRQHandler,      // 288: AUDIO EDMA3: Channel 1 interrupt
    AUDIO_EDMA3_CH2_IRQHandler,      // 289: AUDIO EDMA3: Channel 2 interrupt
    AUDIO_EDMA3_CH3_IRQHandler,      // 290: AUDIO EDMA3: Channel 3 interrupt
    AUDIO_EDMA3_CH4_IRQHandler,      // 291: AUDIO EDMA3: Channel 4 interrupt
    AUDIO_EDMA3_CH5_IRQHandler,      // 292: AUDIO EDMA3: Channel 5 interrupt
    AUDIO_EDMA3_CH6_IRQHandler,      // 293: AUDIO EDMA3: Channel 6 interrupt
